eaglebk/MPLAB_MK400/Head_MK44x.h
#define _WDTPS_1_2H          0xF1
#define _WDTPS_2_2H          0xF3
#define _WDTPS_4_2H          0xF5
#define _WDTPS_8_2H          0xF7
#define _WDTPS_16_2H         0xF9
#define _WDTPS_32_2H         0xFB
#define _WDTPS_64_2H         0xFD
#define _WDTPS_128_2H        0xFF

/*-------------------------------------------------------------------------
 *   CONFIG3H (0x300005)
 *-------------------------------------------------------------------------*/
#define _CONFIG3H_DEFAULT    0x01
#define _CCP2MUX_OFF_3H      0xFE
#define _CCP2MUX_ON_3H       0xFF

/*-------------------------------------------------------------------------
 *   CONFIG4L (0x300006)
 *-------------------------------------------------------------------------*/
#define _CONFIG4L_DEFAULT    0x85
#define _STVR_OFF_4L         0xFE
#define _STVR_ON_4L          0xFF

#define _LVP_OFF_4L          0xFB
#define _LVP_ON_4L           0xFF

#define _DEBUG_ON_4L         0x7F
#define _DEBUG_OFF_4L        0xFF

/*-------------------------------------------------------------------------
 *   CONFIG5L (0x300008)
 *-------------------------------------------------------------------------*/
#define _CONFIG5L_DEFAULT    0xFF
#define _CP0_ON_5L           0xFE
#define _CP0_OFF_5L          0xFF

#define _CP1_ON_5L           0xFD
#define _CP1_OFF_5L          0xFF

#define _CP2_ON_5L           0xFB
#define _CP2_OFF_5L          0xFF

#define _CP3_ON_5L           0xF7
#define _CP3_OFF_5L          0xFF

#define _CP4_ON_5L           0xEF
#define _CP4_OFF_5L          0xFF

#define _CP5_ON_5L           0xDF
#define _CP5_OFF_5L          0xFF

#define _CP6_ON_5L           0xBF
#define _CP6_OFF_5L          0xFF

#define _CP7_ON_5L           0x7F
#define _CP7_OFF_5L          0xFF

/*-------------------------------------------------------------------------
 *   CONFIG5H (0x300009)
 *-------------------------------------------------------------------------*/
#define _CONFIG5H_DEFAULT    0xC0
#define _CPB_ON_5H           0xBF
#define _CPB_OFF_5H          0xFF

#define _CPD_ON_5H           0x7F
#define _CPD_OFF_5H          0xFF

/*-------------------------------------------------------------------------
 *   CONFIG6L (0x30000a)
 *-------------------------------------------------------------------------*/
#define _CONFIG6L_DEFAULT    0xFF
#define _WRT0_ON_6L          0xFE
#define _WRT0_OFF_6L         0xFF

#define _WRT1_ON_6L          0xFD
#define _WRT1_OFF_6L         0xFF

#define _WRT2_ON_6L          0xFB
#define _WRT2_OFF_6L         0xFF

#define _WRT3_ON_6L          0xF7
#define _WRT3_OFF_6L         0xFF

#define _WRT4_ON_6L          0xEF
#define _WRT4_OFF_6L         0xFF

#define _WRT5_ON_6L          0xDF
#define _WRT5_OFF_6L         0xFF

#define _WRT6_ON_6L          0xBF
#define _WRT6_OFF_6L         0xFF

#define _WRT7_ON_6L          0x7F
#define _WRT7_OFF_6L         0xFF

/*-------------------------------------------------------------------------
 *   CONFIG6H (0x30000b)
 *-------------------------------------------------------------------------*/
#define _CONFIG6H_DEFAULT    0xE0
#define _WRTB_ON_6H          0xBF
#define _WRTB_OFF_6H         0xFF

#define _WRTC_ON_6H          0xDF
#define _WRTC_OFF_6H         0xFF

#define _WRTD_ON_6H          0x7F
#define _WRTD_OFF_6H         0xFF

/*-------------------------------------------------------------------------
 *   CONFIG7L (0x30000c)
 *-------------------------------------------------------------------------*/
#define _CONFIG7L_DEFAULT    0x0F
#define _EBTR0_ON_7L         0xFE
#define _EBTR0_OFF_7L        0xFF

#define _EBTR1_ON_7L         0xFD
#define _EBTR1_OFF_7L        0xFF

#define _EBTR2_ON_7L         0xFB
#define _EBTR2_OFF_7L        0xFF

#define _EBTR3_ON_7L         0xF7
#define _EBTR3_OFF_7L        0xFF

#define _EBTR4_ON_7L         0xEF
#define _EBTR4_OFF_7L        0xFF

#define _EBTR5_ON_7L         0xDF
#define _EBTR5_OFF_7L        0xFF

#define _EBTR6_ON_7L         0xBF
#define _EBTR6_OFF_7L        0xFF

#define _EBTR7_ON_7L         0x7F
#define _EBTR7_OFF_7L        0xFF

/*-------------------------------------------------------------------------
 *   CONFIG7H (0x30000d)
 *-------------------------------------------------------------------------*/
#define _CONFIG7H_DEFAULT    0x40
#define _EBTRB_ON_7H         0xBF
#define _EBTRB_OFF_7H        0xFF


#endif

extern				unsigned	char		PAR1;
extern				unsigned	short		SHORT_PAR1;
extern							void		*PTR_PAR1;
extern				unsigned	char		PAR2;
extern							void		*PTR_PAR2;
extern				unsigned	char		PAR3;
extern				unsigned	short		SHORT_PAR3;
extern							void		*PTR_PAR3;
extern				unsigned	char		PAR4;
extern				unsigned	char		PAR5;
extern				unsigned	short		SHORT_PAR5;
extern				unsigned	char		PAR6;
extern				unsigned	char		PAR7;
extern				unsigned	char		PAR8;
extern				unsigned	char		PAR9;
extern				unsigned	char		PAR10;
extern				unsigned	char		PAR11;
extern				unsigned	char		PAR12;
extern				unsigned	char		PAR13;
extern				unsigned	char		PAR14;
extern				unsigned	char		PAR15;
extern				unsigned	char		PAR16;

struct PortHeader {
	unsigned	char	StatusPort;
				void	*PtrPort;
	unsigned	char	CountByte;
	unsigned	short	TOPort;
	};



	extern	void mod_id_app(void);
	extern	unsigned char get_scan_status(void);
	extern	unsigned char get_modbus_reg(unsigned short mb_adr, void *ptr_buf,unsigned char num);
	extern	unsigned char set_modbus_reg(unsigned short mb_adr,void *ptr_buf,unsigned char num);
	extern	void swap_reg(void *ptr_buf,unsigned char num);
	extern	unsigned char get_modbus_bit(unsigned short mb_adr,void *ptr_buf,unsigned char num);
	extern	unsigned char set_modbus_bit(unsigned short mb_adr,void *ptr_buf,unsigned char num);
	extern	void lock_shared_resource(void);
	extern	void unlock_shared_resource(void);
	extern	void get_operative_time(void *ptr_buf);
	extern	void set_operative_time(void *ptr_buf);
	extern	unsigned short get_powersafe_reg3(void);
	extern	void set_powersafe_reg3(unsigned short s_val);
	extern	unsigned short get_powersafe_reg4(void);
	extern	void set_powersafe_reg4(unsigned short s_val);
	extern	unsigned short get_counter10ms(void);
	extern	unsigned char get_counter1s(void);
	extern	void set_record_to_arhiv(unsigned short mb_adr,unsigned char data_type,unsigned char num);
	extern 	float iee2mcflo(float val);
	extern	float mcflo2iee(float val);
/*void fxd3216u(void);
void fxd2416u(void);
void fxd1608u(void);
void fxm32_8(void);
void fxm24_16(void);
void fxm16_8(void);
void bcd2hex(void);
void hex2bcd(void);
void word2float(void);
void fps32(void);
void fpa32(void);*/
//Port1
	extern	unsigned char open_port1(struct PortHeader *ptr_PortHeader);
	extern	unsigned char get_ptr_buffer_port1(struct PortHeader *ptr_PortHeader);
	extern	unsigned char begin_transaction_port1(struct PortHeader *ptr_PortHeader);
	extern	unsigned char get_status_transaction_port1(struct PortHeader *ptr_PortHeader);
	extern	unsigned char close_port1(void);
//Port2
	extern	unsigned char open_port2(struct PortHeader *ptr_PortHeader);
	extern	unsigned char get_ptr_buffer_port2(struct PortHeader *ptr_PortHeader);
	extern	unsigned char begin_transaction_port2(struct PortHeader *ptr_PortHeader);
	extern	unsigned char get_status_transaction_port2(struct PortHeader *ptr_PortHeader);
	extern	unsigned char close_port2(void);
